---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTypeTop
source: html/4a23f50d-a5a4-c5a8-fe36-574e57f29481.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevIndTypeTop Property

"Top Indicator as Prefix/Suffix"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevIndTypeTop { get; }
```